{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "=": 0,
      "a": 1,
      "j": 2,
      "k": 3,
      "q": 4,
      "¡": 5,
      "¢": 6,
      "£": 7,
      "¤": 8,
      "¥": 9,
      "¦": 10,
      "§": 11,
      "¨": 12,
      "©": 13,
      "ª": 14,
      "«": 15,
      "¬": 16,
      "®": 17,
      "¯": 18,
      "°": 19,
      "±": 20,
      "²": 21,
      "³": 22,
      "´": 23,
      "µ": 24,
      "¶": 25,
      "·": 26,
      "¸": 27,
      "¹": 28,
      "º": 29,
      "»": 30,
      "¼": 31,
      "½": 32,
      "¾": 33,
      "¿": 34,
      "â": 35,
      "ã": 36,
      "ä": 37,
      "å": 38,
      "æ": 39,
      "ç": 40,
      "è": 41,
      "é": 42,
      "ï": 43,
      "Ċ": 44,
      "Ġ": 45,
      "Ģ": 46,
      "ģ": 47,
      "Ĥ": 48,
      "ĥ": 49,
      "Ħ": 50,
      "ħ": 51,
      "Ĩ": 52,
      "ĩ": 53,
      "Ī": 54,
      "ī": 55,
      "Ĭ": 56,
      "ĭ": 57,
      "Į": 58,
      "į": 59,
      "İ": 60,
      "ı": 61,
      "Ĳ": 62,
      "ĳ": 63,
      "Ĵ": 64,
      "ĵ": 65,
      "Ķ": 66,
      "ķ": 67,
      "ĸ": 68,
      "Ĺ": 69,
      "ĺ": 70,
      "Ļ": 71,
      "ļ": 72,
      "Ľ": 73,
      "ľ": 74,
      "Ŀ": 75,
      "ŀ": 76,
      "Ł": 77,
      "ł": 78,
      "Ń": 79,
      "ï¼": 80,
      "ï¼Į": 81,
      "ä¸": 82,
      "äº": 83,
      "ĠĠ": 84,
      "æĪ": 85,
      "æĪĳ": 86,
      "äºĨ": 87,
      "ãĢ": 88,
      "ãĢĤ": 89,
      "ä»": 90,
      "ĠĠĠ": 91,
      "âĢ": 92,
      "çļ": 93,
      "çļĦ": 94,
      "è¿": 95,
      "ä¸Ģ": 96,
      "åľ": 97,
      "æĺ": 98,
      "è¯": 99
    },
    "merges": [
      "ï ¼",
      "ï¼ Į",
      "ä ¸",
      "ä º",
      "Ġ Ġ",
      "æ Ī",
      "æĪ ĳ",
      "äº Ĩ",
      "ã Ģ",
      "ãĢ Ĥ",
      "ä »",
      "ĠĠ Ġ",
      "â Ģ",
      "ç ļ",
      "çļ Ħ",
      "è ¿",
      "ä¸ Ģ",
      "å ľ",
      "æ ĺ",
      "è ¯"
    ]
  }
}